{"url":"https://www.reuters.com/technology/crypto-giant-binance-hopes-russia-will-help-regional-growth-2022-01-27/","title":"Crypto giant Binance hopes Russia will help regional growth","ingestTimestamp":1643367361.554721,"content":"Representations of cryptocurrencies Bitcoin, Ethereum, DogeCoin, Ripple, and Litecoin are seen in front of a displayed Binance logo in this illustration taken, June 28, 2021. REUTERS/Dado Ruvic/Illustration/File Photo\n\nMOSCOW, Jan 27 (Reuters) - Binance, the world's largest cryptocurrency exchange, wants to expand in Russia and neighbouring states where it sees prospects for new regulations that will boost its business, an executive said.\n\nRussian politicians have pressed for a change of tack by the central bank, which has proposed restricting cryptocurrency trading and mining because of concerns it may cause financial instability. They say it should instead regulate a business which could draw in more tax revenues.\n\nPresident Vladimir Putin has called for the central bank to find a consensus on how to deal with the cryptocurrency business, which central banks and regulators around the globe have been grappling with.\n\n\"Our goal is to obtain a licence and conduct legal business where the regulation allows,\" Binance Eastern European Director Gleb Kostarev told Reuters, adding that his company hoped for a progressive regulatory approach from Russia that could influence the approach taken by its neighbours.\n\nKostarev said Russia, where the central bank says the annual volume of cryptocurrency transactions stands at about $5 billion, was strategically important for Binance.\n\nHe described the central bank's proposals to restrict trading as harsh, adding: \"For now, we consider this as an invitation to dialogue with the regulator.\"\n\nRussia for years opposed cryptocurrencies, saying they could be used in money laundering or to finance terrorism. It gave them legal status in 2020 but banned their use for payments.\n\nKostarev said Russia's approach now could help determine how other nations in the region dealt with cryptocurrencies.\n\n\"In Ukraine, Kazakhstan and Uzbekistan they are more loyal to cryptocurrencies and are taking steps towards liberalisation, rather than restriction,\" he said. \"But local regulators are taking these steps with an eye on Russia.\"\n\nThe global hashrate, which refers to the computing power used by computers connected to the bitcoin network, was reduced by about 20% this month because of political unrest and power blackouts in Kazakhstan, Binance estimated. read more\n\nKostarev said the rate was now recovering.\n\nA Reuters investigation last week showed Binance withheld information about its finances and corporate structure from regulators, even as it welcomed government oversight and lauded its anti-money laundering programme.\n\nA Binance spokesperson responded saying the company backed \"technologies and legislation that will set the crypto industry on the road to becoming a well-regulated, secure industry.\"\n\nThe investigation also found Binance acted against its own compliance department by recruiting customers in Russia and six other states deemed to be of \"extreme\" money-laundering risk.\n\nBinance said it had \"one of the most sophisticated approaches\" to enforcing anti-money laundering and counter-terrorism financing in the finance sector and internal risk ratings were adjusted according to a range of variables.\n\nReporting by Elena Fabrichnaya; Additional reporting and writing by Alexander Marrow; Editing by Edmund Blair"}