{"url":"https://www.reuters.com/business/sustainable-business/us-utilities-side-with-environment-agency-supreme-court-climate-case-2022-01-27/","title":"U.S. utilities side with environment agency in Supreme Court climate case","ingestTimestamp":1643367360.041446,"content":"Signage is seen at the headquarters of the United States Environmental Protection Agency (EPA) in Washington, D.C., U.S., May 10, 2021. REUTERS/Andrew Kelly/File Photo\n\nWASHINGTON, Jan 27 (Reuters) - U.S. utility industry lobby groups have asked the Supreme Court to preserve the Environmental Protection Agency’s authority to regulate greenhouse gases, arguing that failing to do so could open the door to lawsuits against power and water providers and raise costs for consumers.\n\nNext month, the Supreme Court will hear a bid by states, including coal producer West Virginia, and coal companies to limit federal power to use the landmark Clean Air Act to regulate carbon emissions from power plants. The court, whose 6-3 conservative majority has been skeptical of broad federal agency authority, is scheduled to hear arguments in the case on Feb. 28.\n\nThe Edison Electric Institute and National Association of Clean Water Agencies took the unusual step of filing a joint brief in support of the EPA earlier this week.\n\n\"We are simply saying here ... that EPA has the regulatory authority to address carbon,” Alex Bond, deputy general counsel of EEI, told Reuters. \"We would like to invest the money in new, clean renewable resources, not in fighting about new clean renewable resources.\"\n\nHe said the lobby group has not taken a position on power plant carbon regulations crafted by the Obama-era EPA or the weaker replacement rule written by the Trump administration.\n\nIf the federal agency loses its authority, EEI argued in its brief, groups seeking to restrict the industry's climate emissions could launch a wave of public nuisance claims against utilities. A Supreme Court ruling in 2011 ended those lawsuits by affirming EPA's authority to regulate greenhouse gases.\n\nAmanda Aspatore, chief legal counsel for NACWA, said her organization was also concerned about lawsuits, since wastewater treatment facilities are big power consumers.\n\nDisruptions and costs resulting from lawsuits “will ultimately be borne in part by clean water utilities and local communities who can least afford to pay more for clean water,” she said."}