{"url":"https://edition.cnn.com/2022/01/27/energy/europe-russia-ukraine-gas/index.html","title":"Analysis: Europe could live with less Russian gas. A complete shutdown would be 'catastrophic'","ingestTimestamp":1643367539.023336,"content":"London (CNN Business) The United States and its allies are racing to draw up contingency plans in case supplies of Russian gas crucial to powering businesses and heating homes in Europe are choked off by conflict in Ukraine .\n\nEurope would struggle to survive for long without Russian gas, and finding alternative sources presents a huge logistical challenge — a reality that's stoking concerns about the continent's access to energy during an already difficult winter.\n\n\"There's not really a quick and easy alternative,\" said Janis Kluge, an expert on Eastern Europe at the German Institute for International and Security Affairs.\n\nSenior White House officials told reporters this week they are talking to countries and companies about ramping up output. They're also trying to identify alternative sources of natural gas that could be rerouted to Europe.\n\nYet executing such a large intervention in energy markets would be tricky. New pipelines and gas liquefaction facilities take years to build. And redirecting large volumes of the fossil fuel at a time when the global market and transport networks are already stretched would require cooperation from major gas exporters like Qatar, which may not have much wiggle room.\n\nNikos Tsafos, an energy expert at the Center for Strategic and International Studies, said minor supply disruptions would bend but not break the system. A worst-case scenario in which Russian gas disappears completely, however, would be a different story.\n\n\"A cutoff of gas flows through Ukraine is painful but manageable,\" Tsafos said. \"A total cutoff of Russian energy exports would be catastrophic. There's no way for Europe to replace those volumes in any meaningful way.\"\n\nThe scramble to secure energy supplies for Europe shines a light on how reliant the continent is on Russia to meet its needs. In 2020, Russia accounted for about 38% of the European Union's natural gas imports, shipping almost 153 billion cubic meters, according to data agency Eurostat.\n\n\"This is a kind of 'oh my God' moment where the region realizes it's extremely dependent on Russian gas,\" said Carsten Brzeski, global head of macro research at the Dutch bank ING.\n\nA senior White House official said that Russia would face major economic consequences if it decides to weaponize its energy exports. They noted that oil and gas export revenues provide Russia with half of its federal budget.\n\nBut leaders in Europe and the United States remain worried that Russian President Vladimir Putin could still opt to leverage the country's control of gas supply to increase pressure on Europe should the conflict escalate, eroding popular support for harsh Western sanctions. Preparations are also underway in case pipelines in Ukraine are damaged as a result of fighting there.\n\nHow far can LNG go?\n\nOne option to keep Europe supplied is redirecting shipments of liquefied natural gas, or LNG, which is transported by ocean tankers instead of via pipelines.\n\nSome of that supply has already been shifting to Europe, since producers are attracted by high prices. Europe is set to receive a record amount of LNG in January, according to Alex Froley, a LNG market analyst at Independent Commodity Intelligence Services.\n\nBut much more would be needed if imports from Russia drop sharply. That could be tough to secure, given how stretched the market is already.\n\n\"Global LNG production is already pretty much flat out,\" Froley said. Altering trade routes could also \"place a strain on the shipping market,\" he added.\n\nA source with knowledge of the situation told CNN on Wednesday that Qatar could send some unallocated LNG to Europe, but for meaningful supplies to be delivered, existing customers would have to agree to defer their orders. This could be made possible through diplomatic action by the United States and Europe, the source added.\n\nChina and Japan are the world's top importers of LNG, according to the International Energy Agency.\n\nTsafos of CSIS said that LNG shipments could be used to blunt the impact of reduced Russian supply, but getting them to the countries in Europe that need them most would require complex logistics.\n\nIn a report published this week, the think tank Bruegel noted that while the Iberian peninsula is a \"hotspot for LNG import terminals,\" it wouldn't be easy to direct extra gas to the rest of Europe through existing pipelines because of capacity limits.\n\nA much more severe outcome would be if Russian gas supplies to Europe were cut entirely. In that case, it would be impossible to fill the hole in the coming months, given Russia's huge role in the region's energy ecosystem.\n\n\"This winter, there is simply no other solution than to keep importing Russian gas,\" said Kluge of the German Institute for International and Security Affairs.\n\nRussia is not expected to take this route, which would dramatically escalate tensions and unite Europe against Moscow.\n\n\"The worst scenario of a total stop of Russian gas exports to the EU remains highly unlikely, as it would mark a massive breach of contract by state-controlled supplier Gazprom,\" Henning Gloystein, director of the energy program at consultancy Eurasia Group, told clients Thursday.\n\nThis would \"shatter any EU illusions that Russia is a reliable supplier\" and would likely trigger a \"concerted effort\" within the bloc to \"permanently reduce gas imports from Russia as soon as possible,\" he added.\n\nBut given Putin's unpredictability, government leaders are trying to prepare for all possibilities.\n\nNorway's Prime Minister Jonas Gahr Støre told CNN's Christiane Amanpour on Wednesday that Russia \"playing the gas card\" with the West is \"not a viable path.\" Norway, which provides roughly 20% of Europe's natural gas and sends the vast majority of that through undersea pipelines, will \"deliver at the maximum of our potential,\" he added.\n\n\"We're not going to be able to replace Russia's gas but I think we have to count on the fact that it is in the mutual interest of the one who sells gas and the one who buys gas, that we continue to trade gas,\" the prime minister said."}