{"url":"https://www.mwcbarcelona.com/press-releases/mwc21-barcelona-announces-event-highlights","title":"MWC","ingestTimestamp":1643367638.967032,"content":"Back to business, back to Barcelona for the world’s mobile ecosystem\n\n6 May 2021, London: The GSMA has today announced event highlights for MWC21 Barcelona. The theme of this year’s event is Connected Impact. The programme will explore how AI, 5G, Big Data, and IoT will shape the future and continue to transform lives. It’s time to reconnect, rebuild ­– and reimagine a more connected world.\n\nto encourage thought leadership, discover ground-breaking innovations, and connect with the industry’s most important decision-makers.\n\n“They say that times of crisis accelerate progress and innovation. The impact of this global pandemic has proved no exception to that thinking. The rate of change is phenomenal, and this will be a feature in the MWC programme.” said John Hoffman, CEO GSMA Ltd. “There’s nothing that beats building relationships in person, and I am consistently encouraged by the collective desire to come back together.”\n\nMWC21 includes world-class speakers, the Ministerial Programme, leading-edge exhibitors, start-up innovation at 4YFN, and the Diversity4Tech Summit. The multi-layered health and safety plan, Committed Community, combined with a virtual platform means the global mobile ecosystem can come together safely for networking, collaborating, and deal-making.\n\nSustainability– ahead of the curve in the mobile industry\n\nThe 2021 event aims to be carbon-neutral, much like the 2019 edition, which was officially certified by AENOR International. That certification secured the event as the world’s largest carbon-neutral tradeshow. The GSMA is working to further reduce the event’s environmental impact and carbon footprint as part of its overall leadership on climate action.\n\nWith over 600 keynote and conference speakers, the GSMA is excited to welcome leaders representing a wide range of industries to the MWC21 stage, including mobile, healthcare cloud, and finance :\n\nMeet the leaders who will redefine what it means to be connected this summer at MWC21.\n\nThe GSMA is proud to partner with Accenture to bring you this year’s Diversity4Tech programme. Building on the success of Women4Tech, expanding conversations to include the indisputable case for diversity and inclusion in business. The Diversity4Tech Summit is packed with talks, panels, and awards creating a unique opportunity to influence and accelerate the change needed whilst inspiring the mobile ecosystem to demonstrate authentic leadership.\n\nAt the heart of the event, the GSMA Ministerial Programme will convene policymakers to discuss digital inclusion, network resilience, and maximising the potential of 5G. The world’s political, regulatory and telecom leaders recognise that it has never been more critical to come together to discuss policies for a robust recovery and targeted investment in our digital future. MWC21 will host dozens of delegations from countries and international organisations around the world.\n\n“With much of the world gradually emerging from the Covid-19 crisis, now is the moment to reflect on policies that support digital connectivity, innovation and, critically, economic recovery,” said John Giusti, Chief Regulatory Officer at the GSMA. “The Ministerial Programme at MWC Barcelona always delivers timely, meaningful dialogue and debate — and we are glad to be back.”\n\nThe Most Influential Startup Event in the World\n\nThis year 4YFN moves to the heart of MWC at Fira Gran Via. Over 400 international startups will exhibit their latest products within the ‘Innovation Market’ and 150 speakers will share insights that will drive the ecosystem forward. In the 4YFN Discovery Area, 200 startups will pitch, hoping to attract the attention of leading funds, VCs, and CVCs.\n\nNew this year, the Investors Programme features a summit dedicated to knowledge sharing among the investor community. Recent trends such as investments during COVID-19, fund-IPOs, and tokenization will be discussed. The programme also includes an exciting new impact partnership with UNDP and the Impact Awards, aiming to find the best digital startups driving positive impact towards the 17 Sustainable Development Goals.\n\nWhile there’s nothing that can beat face-to-face interaction to build solid relationships, the addition of digital products that aid virtual attendance allows connecting to become easier, more accessible, and even smarter. From technicians and regulators to founders and government delegations, MWC21 offers even more ways to seal the deal with the most influential attendees.\n\nMWC21 will still be the place where our industry gathers to create Connected Impact for a thriving society. But now, it’s also the place where you can connect with industry decision-makers attending in-person or online.\n\nGet business done - in Barcelona, or from wherever you are in the world.\n\nRegistration for MWC21 is now open.\n\nThe GSMA represents the interests of mobile operators worldwide, uniting more than 750 operators with almost 400 companies in the broader mobile ecosystem, including handset and device makers, software companies, equipment providers and internet companies, as well as organisations in adjacent industry sectors. The GSMA also produces the industry-leading MWC events held annually in Barcelona, Africa, Los Angeles and Shanghai, as well as the Thrive Series of regional conferences. For more information, please visit the GSMA corporate website at www.gsma.com. Follow the GSMA on Twitter: @GSMA."}